In [91]:
import pandas as pd
import math

from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [92]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [93]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [94]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [95]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [96]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.drop('Sex', axis='columns', inplace=True)

In [97]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [98]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [99]:
inputs.Age = inputs.Age.fillna(math.floor(inputs.Age.mean()))
inputs.head(10)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3  29.0   8.4583       0     1
6       1  54.0  51.8625       0     1
7       3   2.0  21.0750       0     1
8       3  27.0  11.1333       1     0
9       2  14.0  30.0708       1     0

In [100]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target, test_size=0.2)

In [101]:
print(len(X_train))
print(len(X_test))

712
179

In [102]:
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB()

In [103]:
model.score(X_test, y_test)

0.8044692737430168

In [104]:
X_test[:10]

     Pclass   Age      Fare  female  male
550       1  17.0  110.8833       0     1
588       3  22.0    8.0500       0     1
409       3  29.0   25.4667       1     0
672       2  70.0   10.5000       0     1
479       3   2.0   12.2875       1     0
669       1  29.0   52.0000       1     0
427       2  19.0   26.0000       1     0
722       2  34.0   13.0000       0     1
513       1  54.0   59.4000       1     0
169       3  28.0   56.4958       0     1

In [106]:
y_test[:10]

550    1
588    0
409    0
672    0
479    1
669    1
427    1
722    0
513    1
169    0
Name: Survived, dtype: int64

In [108]:
model.predict(X_test[:10])

array([1, 0, 1, 0, 1, 1, 1, 0, 1, 0], dtype=int64)

In [109]:
model.predict_proba(X_test[:10])

array([[0.20400593, 0.79599407],
       [0.98607417, 0.01392583],
       [0.03874679, 0.96125321],
       [0.97207201, 0.02792799],
       [0.0244701 , 0.9755299 ],
       [0.00334863, 0.99665137],
       [0.0160437 , 0.9839563 ],
       [0.97480613, 0.02519387],
       [0.00289691, 0.99710309],
       [0.97534506, 0.02465494]])